unearth4334/stm32/platform/src/stm32f4/composite/usbd_conf_composite.c
/**
 * @file usbd_conf_composite.c
 * @brief STM32F4 USB OTG-FS HAL glue for CDC + HID composite device.
 *
 * Differs from the single-class usbd_conf.c in one key way: the OTG_FS
 * Tx FIFO is re-partitioned to serve three IN endpoints (EP1, EP2, EP3)
 * instead of one, matching the composite endpoint map:
 *
 *   Shared RX FIFO    : 128 words (512 B)  — all OUT / setup traffic
 *   EP0 TX FIFO (0)   :  32 words (128 B)  — control responses
 *   EP1 TX FIFO (1)   :  32 words (128 B)  — CDC DATA IN  (0x81, bulk)
 *   EP2 TX FIFO (2)   :   8 words  (32 B)  — CDC CMD IN   (0x82, interrupt)
 *   EP3 TX FIFO (3)   :   4 words  (16 B)  — HID IN       (0x83, interrupt)
 *
 * Total: 204 words < 320 words available on STM32F411 OTG_FS.
 */

#include "stm32f4xx_hal.h"
#include "board.h"

#include "usbd_core.h"
#include "usbd_def.h"
#include "usbd_cdc.h"

extern USBD_HandleTypeDef  hUsbDeviceFS;
extern PCD_HandleTypeDef   hpcd_USB_OTG_FS;

#define DEVICE_FS 0U

/* ── MSP callbacks ───────────────────────────────────────────────────── */

void HAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
    GPIO_InitTypeDef gpio_cfg = {0};

    if (hpcd->Instance == USB_OTG_FS) {
        BOARD_USB_GPIO_CLK_EN();
        BOARD_USB_CLK_EN();

        gpio_cfg.Pin       = BOARD_USB_DM_PIN | BOARD_USB_DP_PIN;
        gpio_cfg.Mode      = GPIO_MODE_AF_PP;
        gpio_cfg.Pull      = GPIO_NOPULL;
        gpio_cfg.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
        gpio_cfg.Alternate = GPIO_AF10_OTG_FS;
        HAL_GPIO_Init((GPIO_TypeDef *)BOARD_USB_DM_PORT, &gpio_cfg);

        HAL_NVIC_SetPriority(BOARD_USB_IRQn, BOARD_USB_IRQ_PRIORITY, 0U);
        HAL_NVIC_EnableIRQ(BOARD_USB_IRQn);
    }
}

void HAL_PCD_MspDeInit(PCD_HandleTypeDef *hpcd)
{
    if (hpcd->Instance == USB_OTG_FS) {
        HAL_NVIC_DisableIRQ(BOARD_USB_IRQn);
    }
}

/* ── USBD LL implementation ───────────────────────────────────────────── */

USBD_StatusTypeDef USBD_LL_Init(USBD_HandleTypeDef *pdev)
{
    hpcd_USB_OTG_FS.Instance               = USB_OTG_FS;
    hpcd_USB_OTG_FS.Init.dev_endpoints     = 4U;  /* EP0..EP3 used */
    hpcd_USB_OTG_FS.Init.speed             = PCD_SPEED_FULL;
    hpcd_USB_OTG_FS.Init.ep0_mps           = 0x40U;
    hpcd_USB_OTG_FS.Init.dma_enable        = DISABLE;
    hpcd_USB_OTG_FS.Init.phy_itface        = PCD_PHY_EMBEDDED;
    hpcd_USB_OTG_FS.Init.Sof_enable        = DISABLE;
    hpcd_USB_OTG_FS.Init.low_power_enable  = DISABLE;
    hpcd_USB_OTG_FS.Init.lpm_enable        = DISABLE;
    hpcd_USB_OTG_FS.Init.vbus_sensing_enable = DISABLE;
    hpcd_USB_OTG_FS.Init.use_dedicated_ep1 = DISABLE;

    hpcd_USB_OTG_FS.pData = pdev;
    pdev->pData            = &hpcd_USB_OTG_FS;

    if (HAL_PCD_Init(&hpcd_USB_OTG_FS) != HAL_OK) {
        return USBD_FAIL;
    }

    /* FIFO partitioning for CDC + HID composite (204 / 320 words used) */
    HAL_PCDEx_SetRxFiFo  (&hpcd_USB_OTG_FS,     0x80U); /* RX  128 words */
    HAL_PCDEx_SetTxFiFo  (&hpcd_USB_OTG_FS, 0U, 0x20U); /* EP0  32 words */
    HAL_PCDEx_SetTxFiFo  (&hpcd_USB_OTG_FS, 1U, 0x20U); /* EP1  32 words (CDC data) */
    HAL_PCDEx_SetTxFiFo  (&hpcd_USB_OTG_FS, 2U, 0x08U); /* EP2   8 words (CDC cmd)  */
    HAL_PCDEx_SetTxFiFo  (&hpcd_USB_OTG_FS, 3U, 0x04U); /* EP3   4 words (HID)      */

    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_DeInit(USBD_HandleTypeDef *pdev)
{
    HAL_PCD_DeInit(pdev->pData);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_Start(USBD_HandleTypeDef *pdev)
{
    HAL_PCD_Start(pdev->pData);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_Stop(USBD_HandleTypeDef *pdev)
{
    HAL_PCD_Stop(pdev->pData);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_OpenEP(USBD_HandleTypeDef *pdev,
                                   uint8_t ep_addr, uint8_t ep_type,
                                   uint16_t ep_mps)
{
    HAL_PCD_EP_Open(pdev->pData, ep_addr, ep_mps, ep_type);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_CloseEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
    HAL_PCD_EP_Close(pdev->pData, ep_addr);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_FlushEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
    HAL_PCD_EP_Flush(pdev->pData, ep_addr);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_StallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
    HAL_PCD_EP_SetStall(pdev->pData, ep_addr);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_ClearStallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
    HAL_PCD_EP_ClrStall(pdev->pData, ep_addr);
    return USBD_OK;
}

uint8_t USBD_LL_IsStallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
    PCD_HandleTypeDef *hpcd = (PCD_HandleTypeDef *)pdev->pData;
    if ((ep_addr & 0x80U) != 0U) {
        return hpcd->IN_ep[ep_addr & 0x7FU].is_stall;
    }
    return hpcd->OUT_ep[ep_addr & 0x7FU].is_stall;
}

USBD_StatusTypeDef USBD_LL_SetUSBAddress(USBD_HandleTypeDef *pdev, uint8_t dev_addr)
{
    HAL_PCD_SetAddress(pdev->pData, dev_addr);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_Transmit(USBD_HandleTypeDef *pdev,
                                     uint8_t ep_addr, uint8_t *pbuf,
                                     uint32_t size)
{
    HAL_PCD_EP_Transmit(pdev->pData, ep_addr, pbuf, (uint16_t)size);
    return USBD_OK;
}

USBD_StatusTypeDef USBD_LL_PrepareReceive(USBD_HandleTypeDef *pdev,
                                          uint8_t ep_addr, uint8_t *pbuf,
                                          uint32_t size)
{
    HAL_PCD_EP_Receive(pdev->pData, ep_addr, pbuf, (uint16_t)size);
    return USBD_OK;
}

uint32_t USBD_LL_GetRxDataSize(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
    return HAL_PCD_EP_GetRxCount(pdev->pData, ep_addr);
}

void USBD_LL_Delay(uint32_t delay)
{
    HAL_Delay(delay);
}

/* ── PCD HAL callbacks → USBD core ───────────────────────────────────── */

void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
    USBD_LL_SetupStage((USBD_HandleTypeDef *)hpcd->pData, (uint8_t *)hpcd->Setup);
}

void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    USBD_LL_DataOutStage((USBD_HandleTypeDef *)hpcd->pData,
                         epnum, hpcd->OUT_ep[epnum].xfer_buff);
}

void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    USBD_LL_DataInStage((USBD_HandleTypeDef *)hpcd->pData,
                        epnum, hpcd->IN_ep[epnum].xfer_buff);
}

void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
    USBD_LL_SOF((USBD_HandleTypeDef *)hpcd->pData);
}

void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
    USBD_LL_SetSpeed((USBD_HandleTypeDef *)hpcd->pData, USBD_SPEED_FULL);
    USBD_LL_Reset((USBD_HandleTypeDef *)hpcd->pData);
}

void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
    USBD_LL_Suspend((USBD_HandleTypeDef *)hpcd->pData);
}

void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
    USBD_LL_Resume((USBD_HandleTypeDef *)hpcd->pData);
}

void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    USBD_LL_IsoOUTIncomplete((USBD_HandleTypeDef *)hpcd->pData, epnum);
}

void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    USBD_LL_IsoINIncomplete((USBD_HandleTypeDef *)hpcd->pData, epnum);
}

void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
    USBD_LL_DevConnected((USBD_HandleTypeDef *)hpcd->pData);
}

void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
    USBD_LL_DevDisconnected((USBD_HandleTypeDef *)hpcd->pData);
}
